{"_id":{"$oid":"5bceed586bfdd3187ff35383"},"name":"Avengers: Infinity War","topImage":"https://cdn-s-www.lejsl.com/images/c40ebd6b-ed8d-400e-90ef-582aff56f914/BES_06/illustration-avengers-infinity-war_1-1526048916.jpg","genres":["5bc75c3aa5b42f589b45a0bd","5bceeec12db4a99e298e0daf"],"language":"English","time":1.5244416e+12,"duration":"2h23m","country":"USA","summary":"Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sequel to 2012's The Avengers and 2015's Avengers: Age of Ultron, and the nineteenth film in the Marvel Cinematic Universe (MCU). The film is directed by Anthony and Joe Russo, written by Christopher Markus and Stephen McFeely, and features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldana, Josh Brolin, and Chris Pratt. In the film, the Avengers and the Guardians of the Galaxy attempt to stop Thanos from amassing the all-powerful Infinity Stones.","casts":["5bcee7d22db4a99e298e0c10","5bceeb162db4a99e298e0cfd","5bceea872db4a99e298e0cd2"]}
{"_id":{"$oid":"5bceef852db4a99e298e0dfe"},"name":"Wonder Woman (2017 film)","topImage":"https://upload.wikimedia.org/wikipedia/en/e/ed/Wonder_Woman_%282017_film%29.jpg","genres":["5bc75c3aa5b42f589b45a0bd","5bceeec12db4a99e298e0daf"],"language":"English","time":1.5244416e+12,"duration":"2h23m","country":"USA","summary":"Wonder Woman is a 2017 American superhero film based on the DC Comics character of the same name, distributed by Warner Bros. Pictures. It is the fourth installment in the DC Extended Universe (DCEU).[6] Directed by Patty Jenkins from a screenplay by Allan Heinberg and a story by Heinberg, Zack Snyder, and Jason Fuchs, Wonder Woman stars Gal Gadot in the title role, alongside Chris Pine, Robin Wright, Danny Huston, David Thewlis, Connie Nielsen, and Elena Anaya. It is the second live action theatrical film featuring Wonder Woman following her debut in 2016's Batman v Superman: Dawn of Justice.[7] In Wonder Woman, the Amazon princess Diana sets out to stop World War I, believing the conflict was started by the longtime enemy of the Amazons, Ares, after American pilot and spy Steve Trevor crash-lands on their island Themyscira and informs her about it.","casts":["5bcee7d22db4a99e298e0c10","5bceeb162db4a99e298e0cfd","5bceea872db4a99e298e0cd2","5bcee8162db4a99e298e0c24"]}
{"_id":{"$oid":"5bcfe3922db4a99e298e14dc"},"name":"Before We Go","topImage":"https://upload.wikimedia.org/wikipedia/en/e/e7/Before_We_Go_Poster.jpg","genres":["5bc75ce0a5b42f589b45a0bf","5bceeec12db4a99e298e0daf","5bcfe87a2db4a99e298e16a7"],"language":"English","time":1.5244416e+12,"duration":"1h53m","country":"UK","summary":"Before We Go is a 2014 American independent romantic drama film directed by Chris Evans in his directorial debut, and starring Evans and Alice Eve. The film had its world premiere in the special presentations section of the 2014 Toronto International Film Festival. The film was released on video on demand on July 21, 2015, and had a limited release on September 4, 2015 in the United States by Radius-TWC.While busking in Grand Central Terminal, Nick Vaughan (Chris Evans) sees a woman, Brooke (Alice Eve), drop her phone while running to catch a train. She misses the train and returns to the station where Nick returns her broken phone. When he finds her standing outside the terminal she confesses that she has just been robbed and is trapped in the city. He offers to pay for a cab to take her to Boston but his credit cards are declined. When he tries to call a friend to come loan him the money he finds his phone has died. Nick offers to try to pay for a room for Brooke for the night, but she insists that she needs to reach Boston by morning.","casts":["5bcee8162db4a99e298e0c24","5bcfe6382db4a99e298e15b2","5bc7606149fa935934a2bf4e","5bcee7d22db4a99e298e0c10","5bcfe4882db4a99e298e1528","5bceea872db4a99e298e0cd2","5bceeb162db4a99e298e0cfd"]}
{"_id":{"$oid":"5bcfe7052db4a99e298e160f"},"name":"Ocean's 8","topImage":"https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg","genres":["5bcfe87a2db4a99e298e16a7","5bceeec12db4a99e298e0daf","5bc75c90a5b42f589b45a0be","5bc75ce0a5b42f589b45a0bf"],"language":"English","time":1.5244416e+12,"duration":"2h10m","country":"USA","summary":"Ocean's 8 (stylized onscreen as Ocean's Eight) is a 2018 American heist comedy film directed by Gary Ross and written by Ross and Olivia Milch. The film is both a continuation and a spin-off from Steven Soderbergh's Ocean's trilogy and features an ensemble cast, including Sandra Bullock, Cate Blanchett, Anne Hathaway, Mindy Kaling, Sarah Paulson, Rihanna, Helena Bonham Carter, and Awkwafina. The film follows a group of women led by Debbie Ocean, the sister of Danny Ocean, who plan a sophisticated heist of the annual Met Gala in New York City. After the release of Ocean's Thirteen in 2007, Soderbergh stated he had no intentions of making a fourth film, citing his desire to have the series go out on top. However, an all-female spin-off was announced in October 2015, with much of the cast signing on by August 2016. Filming took place from October 2016 to March 2017 around New York City.","casts":["5bcfe6382db4a99e298e15b2","5bc7606149fa935934a2bf4e","5bcee7d22db4a99e298e0c10","5bceeb162db4a99e298e0cfd","5bceea872db4a99e298e0cd2","5bcfe4882db4a99e298e1528","5bcee8162db4a99e298e0c24"]}
